USER_AGREEMENT="""欢迎使用 北京题库拓展 应用程序（以下简称“本应用”）。
在开始使用本应用之前，请仔细阅读本用户协议（以下简称“本协议”）。

1. 接受条款：本协议构成您与本应用之间的法律协议，并规范您使用本应用的权利和义务。通过安装、访问或使用本应用，即表示您同意遵守本协议的所有条款和条件。如果您不同意本协议的任何部分，请立即停止使用本应用。

2. 使用许可：
2.1 本应用授予您有限的、非排他性的许可，用于个人非商业目的在您的设备上下载、安装、使用本应用。
2.2 您不得复制、修改、翻译、反编译、反向工程或创建衍生作品，也不能将本应用的一部分或全部内容用于任何商业目的。

3. 用户行为规范：您在使用本应用时，必须遵守适用的法律法规，并确保不会侵犯第三方的权益。

4. 免责声明: 本应用将尽合理努力保证其提供的服务的安全性和准确性。但是，由于不可预见的原因或不可抗力，本应用无法保证服务的连续性和无中断。

5. 协议变更和终止
5.1 本应用保留随时修改本协议的权利。
5.2 如果您不同意修改后的协议内容，您有权停止使用本应用。如果您继续使用本应用，则默认您已经接受修改后的协议。

6. 法律适用和争议解决：本协议的解释、适用和争议解决均适用中华人民共和国的法律。

7. 其他
7.1 如您对本协议或本应用有任何疑问或意见，请联系我们。
7.2 本协议中的标题仅为方便阅读而设，在解释本协议时应被忽略，不能作为本协议条款解释的依据。
7.3 若本协议部分条款被裁定无效，不影响其他条款的效力。
7.4 在法律允许的范围内，开发者保留对本协议的最终解释权。"""
STATEMENT="""本程序非官方、无授权。仅供交流学习，请勿用作商用。
若您使用本程序，则默认：您了解上述说明并同意《用户协议》
"""
CONTRACT="联系开发者：\n@流风\n微信：13671328191\nQQ：499917821\n添加请备注来意"
EMPTY_INPUT="请不要输入空白值或无意义的值。"